app/Controllers/ClientController.php

    public function client_home()
    {

        if(!$this->session->has('is_client_logged_in')){ return redirect()->to(base_url()); }

		if($this->request->getmethod() == 'POST')
		{

		}
        $data['visaList']  = $this->VisaRequestModel->getVisaRequestListByClientId(session()->get('is_client_logged_in'));
        $data['statusCount']  = $this->VisaRequestModel->getVisaRequestBasedOnStatusByClientId(session()->get('is_client_logged_in'));

        $clientdata = $this->ClientModel->where('client_id',$this->session->get('is_client_logged_in'))->get()->getRow();
---
SELECT *
FROM `client`
WHERE `client_id` = '4'

    public function view_visa_request($visa_request_id = null)
	{

            if(!$this->session->has('is_client_logged_in')){ return redirect()->to(base_url()); }

            $visa_request_id = $this->request->getVar('visa_request_id');

            $data['clientData'] = $this->ClientModel->findall();
            $data['statusData'] = $this->StatusModel->findall();
            $data['countryData'] = $this->CountryModel->findall();
            $data['visaTypeData'] = $this->VisaTypeModel->findall();

            $data['visaData'] = $this->VisaRequestModel->getVisaRequestListByClientId(session()->get('is_client_logged_in'), $visa_request_id);
            $data['visaNotesData'] = $this->NotesModel-> getVisaRequestNotes($visa_request_id);

            $clientdata = $this->ClientModel->where('client_id',$this->session->get('is_client_logged_in'))->get()->getRow();
---
SELECT *
FROM `client`
SELECT *
FROM `status`
SELECT *
FROM `country`
SELECT *
FROM `client`
WHERE `client_id` = '4'

    public function client_profile()
	{
		if(!$this->session->has('is_client_logged_in')){ return redirect()->to(base_url()); }
		if($this->request->getmethod() == 'POST')
		{
				//update client profile
				$clientData = $this->request->getVar();

                $clientData['updated_by'] = $this->session->get('is_client_logged_in');
				$client_id =  $this->request->getVar('client_id');
				$this->ClientModel->where('client_id', $client_id )->set($clientData)->update();

				echo true;
		}else{
		$clientdata = $this->ClientModel->where('client_id',$this->session->get('is_client_logged_in'))->get()->getRow();
---
SELECT *
FROM `client`
WHERE `client_id` = '4'