app/Controllers/VisaRequestController.php

SELECT *
FROM `staff`
WHERE `staff_id` = '1'
---
    public function visa_request_list()
    {

        // $data['visaData'] =  $this->VisaRequestModel->getVisaRequestList(session()->get('logged_in_staff_branch_id'), 3);
        $data['client_list'] =  $this->ClientModel->where('is_active',1)->findAll();
        // $data['visaNotesData'] = $this->NotesModel-> getVisaRequestNotes(3);

        // return view('mail_template', $data);

        if(!$this->session->has('is_staff_logged_in')){ return redirect()->to(base_url().'staff'); }


        $data['visaList']  = $this->VisaRequestModel->getVisaRequestList(session()->get('logged_in_staff_branch_id'));
        $data['statusCount']  = $this->VisaRequestModel->getVisaRequestBasedOnStatus(session()->get('logged_in_staff_branch_id'));
        $data['statusCount_client_id']  = $this->VisaRequestModel->getVisaRequestBasedOnStatusCLient_id(session()->get('logged_in_staff_branch_id'));
        $data['status_master'] = $this->StatusModel->where('is_active',1)->findAll();
        $staffdata = $this->StaffModel->where('staff_id',$this->session->get('is_staff_logged_in'))->get()->getRow();

UPDATE `visa_request` SET `client_id` = '4', `traveller_name` = 'Gowtham', `passport_no` = 'CSCSC677', `country_of_visit` = '4', `visa_type` = '2'
WHERE `visa_request_id` = '3'
SELECT *
FROM `client`
SELECT *
FROM `status`
SELECT *
FROM `country`
SELECT *
FROM `staff`
WHERE `staff_id` = '1'
---
    public function edit_visa_request($visa_request_id = null)
	{
		if(!$this->session->has('is_staff_logged_in')){ return redirect()->to(base_url().'staff'); }
		if($this->request->getmethod() == 'POST')
		{
				//update visa details
				$visaData = $this->request->getVar();


				$visa_request_id =  $this->request->getVar('visa_request_id');
				$update = $this->VisaRequestModel->where('visa_request_id', $visa_request_id )->set($visaData)->update();

                if($update)
				echo true;
                else
                echo false;
		}else{

            $visa_request_id = $this->request->getVar('visa_request_id');




            $data['visaData'] = $this->VisaRequestModel->getVisaRequestList(session()->get('logged_in_staff_branch_id'), $visa_request_id);
            $data['visaNotesData'] = $this->NotesModel-> getVisaRequestNotes($visa_request_id);
            $data['reqClientData'] = $this->ClientModel->where('client_id',$data['visaData']->client_id)->get()->getRow();
            $data['clientData'] = $this->ClientModel->findall();
            $data['statusData'] = $this->StatusModel->findall();
            $data['countryData'] = $this->CountryModel->findall();
            $data['visaTypeData'] = $this->VisaRequestModel->getVisaType($data['visaData']->country_of_visit);

		    $staffdata = $this->StaffModel->where('staff_id',$this->session->get('is_staff_logged_in'))->get()->getRow();

UPDATE `visa_request` SET `status` = '5', `is_visa_approved` = 1
WHERE `visa_request_id` = '3'
AND `branch_id` = '1'
---
    public function update_notes()
    {
        $notesData = $this->request->getVar();

        $file = $this->request->getFile('file');

        if ($file->isValid() && !$file->hasMoved()) {
            $newName = $file->getRandomName();
            $file->move(WRITEPATH . 'uploads', $newName);

            $file_name = $newName;
        }

        if($notesData['status'] == 6){

            $updateArray = ['status'=>$notesData['status'],'awb_no'=>$notesData['awb_no']];
            $insertArray = ['visa_request_id'=>$notesData['visa_request_id'],'status'=>$notesData['status'],'notes'=>$notesData['notes'], 'created_by'=>$this->session->get('is_staff_logged_in'),'awb_no'=>$notesData['awb_no'] , 'file'=> isset( $file_name) ?  $file_name : null ];

        }else if($notesData['status'] == 5){

            $is_visa_approved =  isset($notesData['is_visa_approved'])  ? 1 : 0;
            $updateArray = ['status'=>$notesData['status'],'is_visa_approved'=>$is_visa_approved];
            $insertArray = ['visa_request_id'=>$notesData['visa_request_id'],'status'=>$notesData['status'],'notes'=>$notesData['notes'], 'created_by'=>$this->session->get('is_staff_logged_in'),'is_visa_approved'=>$is_visa_approved , 'file'=> isset( $file_name) ?  $file_name : null];

        }else{

            $updateArray = ['status'=>$notesData['status']];
            $insertArray = ['visa_request_id'=>$notesData['visa_request_id'],'status'=>$notesData['status'],'notes'=>$notesData['notes'], 'created_by'=>$this->session->get('is_staff_logged_in') , 'file'=> isset( $file_name) ?  $file_name : null];
        }

        $update =$this->VisaRequestModel->where('visa_request_id',$this->request->getVar('visa_request_id') )
                          ->where('branch_id',$this->session->get('logged_in_staff_branch_id'))
                          ->set($updateArray)->update();