app/Models/ClientModel.php

SELECT `client_id`, `org_name`, `user_name`, `password`, `is_active`
FROM `client`
WHERE `user_name` = 'VIT'
---
	public function verifyUserName($user_name)
	{

		$builder = $this->db->table('client');
		$builder -> select("client_id,user_name,password,is_active,agency");
		$builder -> where('user_name',$user_name);
		$result = $builder->get();