app/Models/NotesModel.php

SELECT `visa_request_notes`.*, `status`.`status_value`, `status`.`status_id`, `staff`.`name` as `created_by`
FROM `visa_request_notes`
JOIN `status` ON `visa_request_notes`.`status` = `status`.`status_id`
JOIN `staff` ON `visa_request_notes`.`created_by` = `staff`.`staff_id`
WHERE `visa_request_notes`.`visa_request_id` = '3'
AND `visa_request_notes`.`is_active` = 1
ORDER BY `visa_request_notes`.`visa_request_notes_id` DESC
---
    public function getVisaRequestNotes($visa_request_id)
    {
         $result =  $this->db->table('visa_request_notes')
                         ->select('visa_request_notes.*,  status.status_value ,status.status_id , staff.name as created_by')
                         ->join('status', 'visa_request_notes.status = status.status_id')
                         ->join('staff', 'visa_request_notes.created_by = staff.staff_id')
                         ->where('md5(visa_request_notes.visa_request_id)',$visa_request_id)
                         ->where('visa_request_notes.is_active',1)
                         ->orderBy('visa_request_notes.visa_request_notes_id','DESC')
                         ->get()
                         ->getResultArray();