app/Models/StaffModel.php

SELECT `staff_id`, `branch_id`, `name`, `email`, `password`, `is_active`, `role`
FROM `staff`
WHERE `email` = 'gowtham.manavalan.la@gmail.com'
---
	public function verifyEmail($email)
	{

		$builder = $this->db->table('staff');
		$builder -> select("staff_id,branch_id,name,email,password,is_active,role");
		$builder -> where('email',$email);
		$result = $builder->get();