app/Models/VisaRequestModel.php

SELECT `visa_request`.*, `client`.`org_name` as `client_name`, `client`.`branch` as `branch`, `client`.`agency` as `agency`, `client`.`email` as `client_email`, `client`.`mobile_no` as `client_mobile`, `country`.`country` as `country_name`, `category`.`category` as `visa_type_name`, `status`.`status_value`
FROM `visa_request`
JOIN `client` ON `visa_request`.`client_id` = `client`.`client_id`
JOIN `country` ON `visa_request`.`country_of_visit` = `country`.`id`
JOIN `category` ON `visa_request`.`visa_type` = `category`.`id`
JOIN `status` ON `visa_request`.`status` = `status`.`status_id`
WHERE `visa_request`.`branch_id` = '1'
AND `visa_request`.`is_active` = 1
AND `visa_request`.`visa_request_id` = '3'
ORDER BY `visa_request`.`visa_request_id` DESC
SELECT `visa_request`.*, `client`.`org_name` as `client_name`, `client`.`branch` as `branch`, `client`.`agency` as `agency`, `client`.`email` as `client_email`, `client`.`mobile_no` as `client_mobile`, `country`.`country` as `country_name`, `category`.`category` as `visa_type_name`, `status`.`status_value`
FROM `visa_request`
JOIN `client` ON `visa_request`.`client_id` = `client`.`client_id`
JOIN `country` ON `visa_request`.`country_of_visit` = `country`.`id`
JOIN `category` ON `visa_request`.`visa_type` = `category`.`id`
JOIN `status` ON `visa_request`.`status` = `status`.`status_id`
WHERE `visa_request`.`branch_id` = '1'
AND `visa_request`.`is_active` = 1
ORDER BY `visa_request`.`visa_request_id` DESC
---
    public function getVisaRequestList($branch_id = null,$visa_request_id = null)
    {
         $result =  $this->db->table('visa_request')
                         ->select('visa_request.* , client.org_name as client_name, client.branch as branch, client.agency as agency ,client.email as client_email ,client.mobile_no as client_mobile, country.country as country_name , category.category as visa_type_name , status.status_value ')
                         ->join('client', 'visa_request.client_id = client.client_id')
                         ->join('country', 'visa_request.country_of_visit = country.id')
                         ->join('category', 'visa_request.visa_type = category.id')
                         ->join('status', 'visa_request.status = status.status_id')
                         ->where('visa_request.branch_id',$branch_id)
                         ->where('visa_request.is_active',1)
                         ->orderBy('visa_request.visa_request_id','DESC');


        if($visa_request_id != null){
            return $result->where('visa_request.visa_request_id',$visa_request_id)->get()->getRow();
        }else{
            return $result->get()->getResultArray();

SELECT COUNT(visa_request.status) as status_count, `status`.`status_value`, `status`.`status_id`
FROM `status`
LEFT JOIN `visa_request` ON `visa_request`.`status` = `status`.`status_id` and `visa_request`.`branch_id` = 1
WHERE `status`.`is_active` = 1
GROUP BY `status`.`status_id`
---
    public function getVisaRequestBasedOnStatus($branch_id)
    {

        $result = $this->db->table('status')
                            ->select('COUNT(visa_request.status) as status_count, status.status_value, status.status_id')
                            ->join('visa_request', "visa_request.status = status.status_id and visa_request.branch_id = {$branch_id}", 'left')
                            ->where('status.is_active', 1)
                            ->groupBy('status.status_id')
                            ->get()
                            ->getResultArray();

SELECT `visa_request`.*, `branches`.`name` as `branch_name`, `client`.`org_name` as `client_name`, `client`.`branch` as `branch`, `client`.`agency` as `agency`, `client`.`email` as `client_email`, `client`.`mobile_no` as `client_mobile`, `country`.`country` as `country_name`, `category`.`category` as `visa_type_name`, `status`.`status_value`
FROM `visa_request`
JOIN `client` ON `visa_request`.`client_id` = `client`.`client_id`
JOIN `branches` ON `visa_request`.`branch_id` = `branches`.`branch_id`
JOIN `country` ON `visa_request`.`country_of_visit` = `country`.`id`
JOIN `category` ON `visa_request`.`visa_type` = `category`.`id`
JOIN `status` ON `visa_request`.`status` = `status`.`status_id`
WHERE `visa_request`.`client_id` = '4'
AND `visa_request`.`is_active` = 1
AND `visa_request`.`visa_request_id` = '3'
ORDER BY `visa_request`.`visa_request_id` DESC
SELECT `visa_request`.*, `branches`.`name` as `branch_name`, `client`.`org_name` as `client_name`, `client`.`branch` as `branch`, `client`.`agency` as `agency`, `client`.`email` as `client_email`, `client`.`mobile_no` as `client_mobile`, `country`.`country` as `country_name`, `category`.`category` as `visa_type_name`, `status`.`status_value`
FROM `visa_request`
JOIN `client` ON `visa_request`.`client_id` = `client`.`client_id`
JOIN `branches` ON `visa_request`.`branch_id` = `branches`.`branch_id`
JOIN `country` ON `visa_request`.`country_of_visit` = `country`.`id`
JOIN `category` ON `visa_request`.`visa_type` = `category`.`id`
JOIN `status` ON `visa_request`.`status` = `status`.`status_id`
WHERE `visa_request`.`client_id` = '4'
AND `visa_request`.`is_active` = 1
ORDER BY `visa_request`.`visa_request_id` DESC
---
    public function getVisaRequestListByClientId($client_id = null,$visa_request_id = null)
    {
         $result =  $this->db->table('visa_request')
                         ->select('visa_request.* , branches.name as branch_name , client.org_name as client_name, client.branch as branch, client.agency as agency ,client.email as client_email ,client.mobile_no as client_mobile, country.country as country_name ,  category.category as visa_type_name  , status.status_value ')
                         ->join('client', 'visa_request.client_id = client.client_id')
                         ->join('branches', 'visa_request.branch_id = branches.branch_id')
                         ->join('country', 'visa_request.country_of_visit = country.id')
                         ->join('category', 'visa_request.visa_type = category.id')
                         ->join('status', 'visa_request.status = status.status_id')
                         ->where('visa_request.client_id',$client_id)
                         ->where('visa_request.is_active',1)
                         ->orderBy('visa_request.visa_request_id','DESC');


        if($visa_request_id != null){
            return $result->where('visa_request.visa_request_id',$visa_request_id)->get()->getRow();
        }else{
            return $result->get()->getResultArray();

SELECT COUNT(visa_request.status) as status_count, `status`.`status_value`, `status`.`status_id`
FROM `status`
LEFT JOIN `visa_request` ON `visa_request`.`status` = `status`.`status_id` and `visa_request`.`client_id` = 4
WHERE `status`.`is_active` = 1
GROUP BY `status`.`status_id`
---
    public function getVisaRequestBasedOnStatusByClientId($client_id)
    {
        $result = $this->db->table('status')
                        ->select('COUNT(visa_request.status) as status_count, status.status_value, status.status_id')
                        ->join('visa_request', "visa_request.status = status.status_id and visa_request.client_id = {$client_id}", 'left')
                        ->where('status.is_active', 1)
                        ->groupBy('status.status_id')
                        ->get()
                        ->getResultArray();

SELECT `category`.*
FROM `visa_summary`
JOIN `category` ON `visa_summary`.`vs_category` = `category`.`id`
WHERE `visa_summary`.`vs_country` = '4'
---
    public function getVisaType($countryId)
    {
        $result =  $this->db->table('visa_summary')
                            ->select('category.*')
                            ->join('category', 'visa_summary.vs_category = category.id')
                            ->where('visa_summary.vs_country',$countryId)
                            ->get()->getResultArray();